<template>
  <div class="signup">
    <div class="wrapper">
      <div class="container">
        <div class="nav-header-logo">
          <a href="/#/index"></a>
        </div>
        <h2>注册账号</h2>
        <div class="sginupform">
          <div class="from">
            <span>账户用户名</span>
            <div class="input">
              <el-input placeholder="请输入账户用户名" class="inputtext" v-model="username" clearable></el-input>
            </div>
          </div>
          <div class="from">
            <span>密码</span>
            <div class="input">
              <el-input placeholder="请输入8位以上的密码" v-model="password" class="inputtext" show-password></el-input>
            </div>
          </div>
          <div class="from">
            <span>手机号码</span>
            <div class="input usertelephone">
              <el-input
                placeholder="请输入您的手机号码"
                v-model="telephone	"
                class="inputtext"
                show-word-limit
                maxlength="11"
              ></el-input>
              <div class="cbutton">
                <el-button
                  type="info"
                  @click="sends"
                  v-if="!sendMsgDisabled"
                  icon="el-icon-message"
                  circle
                ></el-button>
                <el-button
                  type="info"
                  v-if="sendMsgDisabled"
                  style="background:#dfe6e9"
                  icon="el-icon-loading"
                  circle
                ></el-button>
                <span class="nobold" v-if="sendMsgDisabled">{{time+'秒重新后获取'}}</span>
                <span class="nobold" v-if="!sendMsgDisabled" @click="sends">点击获取验证码</span>
              </div>
            </div>
          </div>
          <div class="from">
            <span>验证码</span>
            <div class="input usertelephone">
              <el-input
                placeholder="请输入验证码"
                v-model="checkcode"
                show-word-limit
                maxlength="6"
                class="inputtext"
              ></el-input>
              <div class="cbutton" @click="checkTelCode">
                <el-button
                  type="info"
                  v-show="iconChoice == 'check' "
                  icon="el-icon-s-check"
                  circle
                ></el-button>
                <el-button
                  type="info"
                  v-show="iconChoice == 'checkyes'"
                  icon="el-icon-check"
                  circle
                ></el-button>
                <el-button type="info" v-show="iconChoice == 'checkno'" icon="el-icon-close" circle></el-button>
                {{telephoneCodeTip}}
              </div>
            </div>
          </div>
          <div class="info">
            <span class="checkbox" :class="{'checked':checked}" @click="changcheck"></span>
            已同意
            <a @click="showUsercontract=true">用户协议</a> 和
            <a @click="showPrivate=true">隐私政策</a>
          </div>
          <div class="btn btn-submit" @click="register">立刻注册</div>
        </div>
        <modal
          title="隐私政策"
          btnType="1"
          :showModal="showPrivate"
          @submit="showPrivate=false"
          @cancel="showPrivate=false"
        >
          <template v-slot:body>
            <article class="priart">
              <p>我们重视用户的隐私。您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。</p>
              <p>您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。</p>
              <p>如对本《隐私政策》或相关事宜有任何问题，请通过yeyuanshen@128xy.com与我们联系。</p>
              <p>我们可能收集的信息</p>
              <p>我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。</p>
              <p>您提供的信息</p>
              <p>您在使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件或银行卡号等；</p>
              <p>您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。</p>
              <p>其他方分享的您的信息</p>
              <p>其他方使用我们的服务时所提供有关您的共享信息。</p>
              <p>我们获取的您的信息</p>
              <p>您使用服务时我们可能收集如下信息：</p>
              <p>日志信息，指您使用我们的服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息，包括：</p>
              <p>设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；</p>
              <p>在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；</p>
              <p>有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；</p>
              <p>位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息，包括：</p>
              <p>您通过具有定位功能的移动设备使用我们的服务时，通过GPS或WiFi等方式收集的您的地理位置信息；</p>
              <p>您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息；</p>
              <p>您可以通过关闭定位功能，停止对您的地理位置信息的收集。</p>
              <p>我们可能如何使用信息</p>
              <p>我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</p>
              <p>向您提供服务；</p>
              <p>在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</p>
              <p>帮助我们设计新服务，改善我们现有服务；</p>
              <p>使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；</p>
              <p>向您提供与您更加相关的广告以替代普遍投放的广告；</p>
              <p>评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；</p>
              <p>软件认证或管理软件升级；</p>
              <p>让您参与有关我们产品和服务的调查。</p>
              <p>为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。</p>
              <p>您如何访问和控制自己的个人信息</p>
              <p>我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。</p>
              <p>我们可能分享的信息</p>
              <p>除以下情形外，未经您同意，我们不会与任何第三方分享您的个人信息：</p>
              <p>我们可能将您的个人信息与第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的法域），用作下列用途：</p>
              <p>向您提供我们的服务；</p>
              <p>实现“我们可能如何使用信息”部分所述目的；</p>
              <p>履行我们在本《隐私政策》中的义务和行使我们的权利；</p>
              <p>理解、维护和改善我们的服务。</p>
              <p>如我们与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施。</p>
              <p>随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。</p>
              <p>我们还可能为以下需要而保留、保存或披露您的个人信息：</p>
              <p>遵守适用的法律法规；</p>
              <p>遵守法院命令或其他法律程序的规定；</p>
              <p>遵守相关政府机关的要求；</p>
              <p>为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们、其他用户的人身和财产安全或合法权益所合理必需的用途。</p>
              <p>信息安全</p>
              <p>我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。 我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。</p>
              <p>您分享的信息</p>
              <p>我们的多项服务，可让您不仅与自己的社交网络，也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是，我们的社交媒体服务，是专为使您与世界各地的用户共享信息而设计，您可以使共享信息实时、广泛地传递。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公共领域保存。</p>
              <p>因此，请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您共享信息的用户范围。如要求从我们的服务中删除您的相关信息，请通过该等特别服务条款提供的方式操作。</p>
              <p>您分享的敏感个人信息</p>
              <p>某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。</p>
              <p>请注意，您在使用我们的服务时所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。</p>
              <p>您同意按本《隐私政策》所述的目的和方式来处理您的敏感个人信息。</p>
              <p>我们可能如何收集信息</p>
              <p>我们或我们的第三方合作伙伴，可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存为日志信息。</p>
              <p>我们使用自己的cookies和web beacon，目的是为您提供更个性化的用户体验和服务，并用于以下用途：</p>
              <p>记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息；</p>
              <p>分析您使用我们服务的情况。例如，我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动，或哪些网页或服务最受您的欢迎；</p>
              <p>广告优化。Cookies和web beacon有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。</p>
              <p>我们为上述目的使用cookies和web beacon的同时，可能将通过cookies和web beacon收集的非个人身份信息，经统计加工后提供给广告商或其他合作伙伴，用于分析用户如何使用我们的服务，并用于广告服务。</p>
              <p>我们的产品和服务上可能会有广告商或其他合作方放置的cookies和web beacon。这些cookies和web beacon可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方cookies和web beacon收集和使用该等信息，不受本《隐私政策》约束，而是受相关使用者的隐私政策约束，我们不对第三方的cookies或web beacon承担责任。</p>
              <p>您可以通过浏览器设置拒绝或管理cookies或web beacon。但请注意，如果停用cookies或web beacon，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。</p>
              <p>广告服务</p>
              <p>我们可能使用您的相关信息，向您提供与您更加相关的广告。</p>
              <p>我们也可能使用您的信息，通过我们的服务、电子邮件或其他方式向您发送营销信息，提供或推广我们或第三方的如下商品和服务：</p>
              <p>我们的服务，我们的关联公司和合作伙伴的商品或服务，包括即时通讯服务、网上媒体服务、互动娱乐服务、社交网络服务、付款服务、互联网搜索服务、位置和地图服务、应用软件和服务、数据管理软件和服务、网上广告服务、互联网金融，以及其他社交媒体、娱乐、电子商务、资讯和通讯软件或服务（统称“互联网服务”）；</p>
              <p>第三方互联网服务供应商，以及与下列有关的第三方商品或服务：食物和餐饮、体育、音乐、电影、电视、现场表演及其他艺术和娱乐、书册、杂志和其他刊物、服装和配饰、珠宝、化妆品、个人健康和卫生、电子、收藏品、家用器皿、电器、家居装饰和摆设、宠物、汽车、酒店、交通和旅游、银行、保险及其他金融服务、会员积分和奖励计划，以及我们认为可能与您相关的其他商品或服务。</p>
              <p>如您不希望我们将您的个人信息用作前述广告用途，您可以通过我们在广告中提供的相关提示，或在特定服务中提供的指引，要求我们停止为上述用途使用您的个人信息。</p>
              <p>我们可能向您发送的邮件和信息</p>
              <p>邮件和信息推送</p>
              <p>您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。</p>
              <p>与服务有关的公告</p>
              <p>我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。</p>
              <p>隐私政策的适用例外</p>
              <p>我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：</p>
              <p>您利用 “分享”键将某些内容分享到我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；</p>
              <p>我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站。</p>
              <p>该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。</p>
              <p>未成年人使用我们的服务</p>
              <p>我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。</p>
              <p>隐私政策的适用范围</p>
              <p>除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。</p>
              <p>请您注意，本《隐私政策》不适用于以下情况：</p>
              <p>通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；</p>
              <p>通过在我们服务中进行广告服务的其他公司或机构所收集的信息。</p>
              <p>变更</p>
              <p>我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。</p>
              <p></p>
              <p>用户协议</p>
              <p>（以下简称“本公司”）按照下列条款与条件提供信息和产品，您在本协议中亦可被称为“用户”，以下所述条款和条件将构成您与本公司，就您使用提供的内容所达成的全部协议（以下称“本协议”）。</p>
              <p>
                <b>说明</b>
              </p>
              <p>本公司向您提供包括但不限于游戏下载、使用、充值、客户服务、游戏资讯、论坛交流等服务（以下称“本服务”）。本公司针对本服务所制定的相关规定，包括但不限于本公司在游戏平台下运营的任何一款游戏所包含的游戏规则、用户处罚条例，客服条例等，以及本公司就账号使用及管理、游戏充值等服务制定的相关服务协议、规则。本公司在此提示用户，请您在使用本服务前详细阅读本协议的所有内容，尤其是免除、限制本公司责任或者限制用户权利的条款（特别是粗体下划线标注的内容），如您对本协议有任何疑问，请向本公司（020-3755991）进行咨询。一旦您使用本服务，即表示您已阅读并完全同意接受本协议项下所述条款和条件的约束。如果您不同意本协议的任何条款，请您不要使用本服务。未成年人应经其监护人陪同阅读本服务协议并表示同意，方可接受本服务协议。监护人应加强对未成年人的监督和保护，因其未谨慎履行监护责任而损害未成年人利益或者本公司利益的，应由监护人承担责任。</p>
              <p>
                <b>权利声明</b>
              </p>
              <p>1、本公司及其关联公司（关联企业指与本公司存在直接或间接，股权或以协议安排等其他形式的控制与被控制关系，以及对公司运营具有重大影响关系的公司法人）享有并保留以下各项内容完整的、不可分割的所有权及/或知识产权：</p>
              <p>（1）游戏平台相关的软件、技术、程序、代码、用户界面等；</p>
              <p>（2）本服务相关的商标、图形标记。</p>
              <p>2、本公司提供的服务内容中所涉及的游戏，文字、软件、声音、图片、动画、录像、图表等，均受相关知识产权法以及其他相关法律的保护。未经本公司或者其他相关权利人授权，用户不得复制、使用、修改、摘编、翻译、发行,第三方未经本公司及/或其相关权利人的书面许可，不得以任何方式擅自进行使用。</p>
              <p>
                <b>责任限制</b>
              </p>
              <p>
                <b>1、</b>
                <b>本公司</b>
                <b>向用户提供的服务均是在依"现状"提供，</b>
                <b>本公司</b>
                <b>在此明确声明对本服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性、准确性、及时性、可持续性等。</b>
              </p>
              <p>
                <b>2、用户理解并同意自行承担使用本服务的风险，且用户在使用本服务时，应遵循中国法律的相关规定，由于用户行为所造成的任何损害和后果，</b>
                <b>本公司</b>
                <b>均不承担除法律有明确规定外的责任。</b>
              </p>
              <p>
                <b>3、不论在何种情况下，</b>
                <b>本公司</b>
                <b>均不对由于网络连接故障、通讯线路、第三方网站、电脑硬件等任何原因给用户造成的任何损失承担除法律有明确规定外的责任。</b>
              </p>
              <p>
                <b>用户行为规范</b>
              </p>
              <p>1、用户在本网站注册时，不得使用虚假身份信息。用户应当妥善保存其账户信息和密码，由于用户泄密所导致的损失需由用户自行承担。如用户发现他人冒用或盗用其账户或密码，或其账户存在其他未经合法授权使用之情形，应立即以有效方式通知本公司。用户理解并同意本公司有权根据用户的通知、请求或依据判断，采取相应的行动或措施，包括但不限于冻结账户、限制账户功能等，本公司对采取上述行动所导致的损失不承担除法律有明确规定外的责任。</p>
              <p>2、用户在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括但不限于：</p>
              <p>（1）发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；</p>
              <p>（2）发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</p>
              <p>（3）恶意虚构事实、隐瞒真相以误导、欺骗他人；</p>
              <p>（4）发布、传送、传播广告信息及垃圾信息；</p>
              <p>（5）其他法律法规禁止的行为。</p>
              <p>3、用户不得利用本服务进行任何有损本公司及其关联企业之权利、利益及商誉，或其他用户合法权利之行为。</p>
              <p>4、用户不得基于本服务从事制作、使用、传播“私服”、“外挂”等侵害本公司合法权益的行为。如有违反，本公司将依据中国现行法律法规及本公司的相关规定予以处理。</p>
              <p>5、虚拟财产转移服务外，用户不得通过任何方式直接或变相进行游戏账号、游戏币、游戏道具等虚拟财产的转移。</p>
              <p>6、用户不得从事作弊等损害游戏公平性的行为。用户承诺接受本公司对其游戏数据进行分析，当本公司发现其数据异常时，本公司可根据自己的独立判断认定其为作弊。</p>
              <p>7、用户不得从事任何利用本公司平台系统漏洞进行有损其他用户、本公司或互联网安全的行为。</p>
              <p>8、用户知悉并确认，本公司通过公告、邮件、短信、账户通知以及用户在账户中登记的即时通讯工具等方式，向用户发出关于本服务的通知、规则、提示等信息，均为有效通知。该等信息一经公布或发布，即视为已送达至用户。</p>
              <p>
                <b>广告信息和促销</b>
              </p>
              <p>
                <b>1、用户同意接受</b>
                <b>本公司</b>
                <b>通过公告、邮件、短信、账户通知以及用户在账户中登记的即时通讯工具等方式发送的有关本服务，或</b>
                <b>本公司</b>
                <b>、</b>
                <b>本公司</b>
                <b>之关联企业或与</b>
                <b>本公司</b>
                <b>有合作关系的第三方相关的商品、服务促销或其他商业信息。</b>
              </p>
              <p>
                <b>2、</b>
                <b>本公司</b>
                <b>在本服务中可能提供与其他互联网之网站站点或资源的链接，</b>
                <b>本公司</b>
                <b>对存在或源于此类网站站点或资源的任何内容、广告、产品或其他资料不予保证或负责；如该链接所载的内容或搜索引擎所提供之链接的内容侵犯用户权利，</b>
                <b>本公司</b>
                <b>声明与上述内容无关，且不承担除法律有明确规定外的责任。</b>
              </p>
            </article>
          </template>
        </modal>
        <modal
          title="用户协议"
          btnType="1"
          :showModal="showUsercontract"
          @submit="showUsercontract=false"
          @cancel="showUsercontract=false"
        >
          <template v-slot:body>
            <div class="priart">
              <div>
                尊敬的用户，欢迎您注册成为本网站用户。在注册前请您仔细阅读如下服务条款：
                <br />本服务协议双方为本网站与本网站用户，本服务协议具有合同效力。
                <br />您确认本服务协议后，本服务协议即在您和本网站之间产生法律效力。请您务必在注册之前认真阅读全部服务协议内容，如有任何疑问，可向本网站咨询。
                <br />无论您事实上是否在注册之前认真阅读了本服务协议，只要您点击协议正本下方的&quot;注册&quot;按钮并按照本网站注册程序成功注册为用户，您的行为仍然表示您同意并签署了本服务协议。&nbsp; 一、
                <br />本网站服务条款的确认和接纳
                <br />本网站各项服务的所有权和运作权归本网站拥有。
                <br /> 二、
                <br />用户必须：
                <br />(1) 自行配备上网的所需设备， 包括个人电脑、调制解调器或其他必备上网装置。 (2) 自行负担个人上网所支付的与此服务有关的电话费用、网络费用。 
                <br />三、
                <br />用户在本网站上交易平台上不得发布下列违法信息：
                <br />(1)对宪法所确定的基本原则的；
                <br />(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； (3)损害国家荣誉和利益的；
                <br />(4)煽动民族仇恨、民族歧视，破坏民族团结的； (5)破坏国家宗教政策，宣扬邪教和封建迷信的； (6)散布谣言，扰乱社会秩序，破坏社会稳定的；
                <br />(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； (8)侮辱或者诽谤他人，侵害他人合法权益的； (9)含有法律、行政法规禁止的其他内容的。&nbsp; 
                <br />四、
                <br />有关个人资料
                <br />用户同意：
                <br />(1)提供及时、详尽及准确的个人资料。 (2)同意接收来自本网站的信息。
                <br />(3)不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。
                <br />(4)本网站不公开用户的姓名、地址、电子邮箱和笔名，以下情况除外： （a）用户授权本网站透露这些信息。
                <br />（b）相应的法律及程序要求本网站提供用户的个人资料。如果用户提供的资料包含有不正确的信息，本网站保留结束用户使用本网站信息服务资格的权利。&nbsp;
              </div>
              <div>&nbsp;</div>
              <div>
                
                五、
                <br /> 用户在注册时应当选择稳定性及安全性相对较好的电子邮箱，且同意接受并阅读
                <br />本网站发往用户的各类电子邮件。如用户未及时从自己的电子邮箱接受电子邮件或因用户电子邮箱或用户电子邮件接收及阅读程序本身的问题使电子邮件无法正常接收或阅读的，只要本网站成功发送了电子邮件，应当视为用户已经接收到相关的电子邮件。电子邮件在发信服务器上所记录的发出时间视为送达时间。&nbsp;&nbsp;&nbsp;&nbsp; 
                <br />六、
                <br />用户在注册时应当选择常用的手机号码，且同意接受并阅读本网站发往用户的各
                <br />类短信。如用户未及时从自己的手机接受短信或因用户手机或用户短信接收及阅读程序本身的问题使短信无法正常接收或阅读的，只要本网站成功发送了手机短信，应当视为用户已经接收到相关的短信。
                <br />用户在注册时应当填写正确、有效的手机号码，此手机号码用以找回密码。如因用户未填写正确、有效的手机号码而导致密码无法找回，无法正确登陆本网站造成用户本人损失的，本网站不承担相关责任。 
                <br />七、
                <br />服务条款的修改
                <br />本网站有权在必要时修改服务条款，本网站服务条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动取消获得的本网站信息服务。如果用户继续享用本网站信息服务，则视为接受服务条款的变动。本网站保留随时修改或中断服务而不需通知用户的权利。本网站行使修改或中断服务的权利，不需对用户或第三方负责。&nbsp; 
                <br />八、
                <br />用户隐私制度
                <br />尊重用户个人隐私是本网站的一项基本政策。所以，本网站一定不会在未经合法用户授权时公开、编辑或透露其注册资料及保存在本网站中的非公开内容，除非有法律许可要求或本网站在诚信的基础上认为透露这些信息在以下四种情况是必要的： (1)遵守有关法律规定，遵从本网站合法服务程序。 (2)保持维护本网站的商标所有权。
                <br />(3)在紧急情况下竭力维护用户个人和社会大众的隐私安全。 (4)合其他相关的要求。
                <br />本网站保留发布会员人口分析资询的权利。&nbsp; 
                <br />九、
                <br />用户的帐号、密码和安全性
                <br />你一旦注册成功成为用户，你将得到一个密码和帐号。如果你不保管好自己的帐号和密码安全，将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。你可随时根据指示改变你的密码，也可以结束旧的帐户重开一个新帐户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，请立即通告本网站。&nbsp; 
                <br />十、
                <br />拒绝提供担保
                <br />用户明确同意信息服务的使用由用户个人承担风险。 本网站不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保，但会在能力范围内，避免出错。&nbsp;
              </div>
              <div>&nbsp;</div>
              <div>
                十一、 有限责任
                <br />本网站对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用本网站服务，或用户传送的信息不符合规定等。这些行为都有可能导致本网站形象受损，所以本网站事先提出这种损害的可能性，同时会尽量避免这种损害的发生。&nbsp; 
                <br />十二、 信息的储存及限制
                <br />本网站有判定用户的行为是否符合本网站服务条款的要求和精神的权利，如果用户违背本网站服务条款的规定，本网站有权中断其服务的帐号。&nbsp; 
                <br />十三、 用户管理
                <br />用户必须遵循：
                <br />(1) 使用信息服务不作非法用途。 (2) 不干扰或混乱网络服务。
                <br />(3) 遵守所有使用服务的网络协议、规定、程序和惯例。用户的行为准则是以因特网法规，政策、程序和惯例为根据的。&nbsp; 
                <br />十四、 保障
                <br />用户同意保障和维护本网站全体成员的利益，负责支付由用户使用超出服务范围引起的律师费用，违反服务条款的损害补偿费用，其它人使用用户的电脑、帐号和其它知识产权的追索费。&nbsp; 
                <br />十五、 结束服务
                <br />用户或本网站可随时根据实际情况中断一项或多项服务。本网站不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对本网站服务不满，用户可以行使如下权利： (1) 不再使用本网站信息服务。 (2) 通知本网站停止对该用户的服务。
                <br />结束用户服务后，用户使用本网站服务的权利马上中止。从那时起，用户没有权利，本网站也没有义务传送任何未处理的信息或未完成的服务给用户或第三方。&nbsp; 
                <br />十六、 通告
                <br />所有发给用户的通告都可通过重要页面的公告或电子邮件或常规的信件传送。服务条款的修改、服务变更、或其它重要事件的通告都会以此形式进行。&nbsp; 
                <br />十七、 信息内容的所有权
                <br />本网站定义的信息内容包括：文字、软件、声音、相片、录象、图表；在广告中全部内容；本网站为用户提供的其它信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在本网站和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。&nbsp;
              </div>
            </div>
          </template>
        </modal>
      </div>
    </div>
  </div>
</template>
<script>
import Modal from "./../components/Modal";
export default {
  name: "signup",
  props:{
    showModal:String
  },
  data() {
    return {
      value: "",
      username: "",
      password: "",
      telephone: "",
      iconChoice: "check",
      checkcode: "", //验证码
      telephoneCodeTip: "点击检验验证码",
      checked: false,
      time: 60, // 发送验证码倒计时
      sendMsgDisabled: false, //验证码区是否禁用
      codeCheckResult: "", //验证码检验
      showPrivate: false, //隐私政策弹框
      showUsercontract: false //用户协议弹框
    };
  },
  components: { Modal },
  methods: {
    register() {
      if (this.username == "") {
        this.$message.warning("请填写用户名");
        return;
      } else if (this.password == "") {
        this.$message.warning("请填写密码");
        return;
      } else if (!/\d{8}/.test(this.password)) {
        this.$message.warning("请填写8位数以上的密码");
        return;
      } else if (!this.telephone || !/\d{11}/.test(this.telephone)) {
        this.$message.error("请输入正确格式的手机号码");
        return;
      } else if (!this.checkcode || !/\d{6}/.test(this.checkcode)) {
        this.$message.error("请输入正确格式的验证码");
        return;
      } else if (!(this.codeCheckResult == "OK")) {
        this.$message.error("验证码未通过，请重试");
        return;
      } else if (this.checked == false) {
        this.$message.warning("请同意用户协议和隐私政策");
        return;
      } else {
        this.axios
          .post("/users/register", {
            code: this.checkcode,
            userName: this.username,
            userPassword: this.password,
            userTelephone: this.telephone
          })
          .then(() => {
            this.$message.success("注册成功，正在为您跳转到登录页面");
            this.$router.push("/login");
          });
      }
    },
    changcheck() {
      this.checked = !this.checked;
    },
    sends() {
      if (!this.telephone || !/\d{11}/.test(this.telephone)) {
        this.$message.error("请输入正确格式的手机号码");
        return;
      }
      let _this = this;
      this.axios.post("/sms/send/?phoneNum=" + _this.telephone).then(() => {
        this.$message.success("短信已发送,请查收");
      });
      _this.sendMsgDisabled = true;
      let interval = setInterval(function() {
        if (_this.time-- <= 0) {
          _this.time = 60;
          _this.sendMsgDisabled = false;
          clearInterval(interval);
        }
      }, 1000);
    },
    checkTelCode() {
      if (!this.telephone || !/\d{11}/.test(this.telephone)) {
        this.$message.error("请输入正确格式的手机号码");
        return;
      } else if (!this.checkcode || !/\d{6}/.test(this.checkcode)) {
        this.$message.error("请输入正确格式的验证码");
        return;
      }
      this.axios
        .post("/sms/check", {
          code: this.checkcode,
          telephone: this.telephone
        })
        .then(res => {
          this.codeCheckResult = res.data.msg;
          if (this.codeCheckResult == "OK") {
            this.iconChoice = "checkyes";
            this.telephoneCodeTip = "手机号码验证通过";
            this.$message.success("手机号码验证通过");
          } else {
            this.iconChoice = "checkno";
            this.telephoneCodeTip = "手机号码验失败";
            this.$message.error("手机号码验证失败");
          }
        });
    }
  }
};
</script>
<style lang="scss">
.input {
  margin: 10px 0;
  display: block;
  width: 332px;
  height: 42px;
  border: 1px solid #e5e5e5;
  margin-bottom: 20px;
  input {
    width: 100%;
    height: 100%;
    border: none;
    padding: 18px;
  }
}
.signup {
  .wrapper {
    .container {
      text-align: center;
      h2 {
        margin-top: 46px;
        font-size: 30px;
        font-weight: 400;
      }
      .sginupform {
        text-align: left;
        margin-top: 42px;
        box-sizing: border-box;
        position: absolute;
        left: 50%;
        transform: translate(-50%);
        .country {
          font-size: 14px;
          margin-bottom: 20px;
          span {
            font-size: 14px;
            font-weight: bold;
          }
          .slectcountry {
            margin: 10px 0;
            .el-select {
              width: 332px;
              height: 42px;
              font-size: 14px;
            }
          }
          p {
            color: #999999;
          }
        }
        .from {
          display: block;
          .inputtext {
            height: 42px;
            line-height: 42px;
          }
          // .password {
          //   height: 42px;
          //   line-height: 42px;
          // }
          span {
            font-size: 14px;
            font-weight: bold;
          }
          .usertelephone {
            position: relative;
            .cbutton {
              width: 400px;
              position: absolute;
              top: 2px;
              left: 355px;
              cursor: pointer;
              .el-button--info {
                background: #74b9ff;
                border: #74b9ff;
              }
              .el-button + .el-button {
                margin: 0;
              }
              .nobold{
                font-weight: 500;
              }
            }
          }
        }
        .info {
          font-size: 18px;
          &::nth-child(2) {
            cursor: pointer;
          }
          .checkbox {
            display: inline-block;
            width: 22px;
            height: 22px;
            border: 1px solid #e5e5e5;
            vertical-align: middle;
            margin-right: 17px;
            cursor: pointer;
            &.checked {
              background: url("/imgs/icon-gou.png") #409eff no-repeat center;
              background-size: 16px 12px;
              border: none;
            }
          }
          a {
            cursor: pointer;
            color: #999999;
          }
          span {
            color: #999999;
          }
        }
        .btn {
          margin-top: 43px;
        }
      }
      .priart {
        text-align: left;
        height: 350px;
        overflow: scroll;
        p {
          margin-bottom: 10px;
        }
      }
    }
  }
}
</style>
